/*
*   Math.js
*
*  Math helper functions
*/

module.exports = {
  /*
  |--------------------------------------------------------------------------
  | Получить рандомное целочисельное
  |--------------------------------------------------------------------------
  */
  getRandomInt: function (min, max) {
    return Math.floor(Math.random() * (max - min + 1)) + min
  },


  /*
  |--------------------------------------------------------------------------
  | Получить рандомный индекс в пределе размера данного массива
  |--------------------------------------------------------------------------
  */
  getRandomIndexFromArray: function (array) {
    return Math.floor(Math.random() * array.length)
  }
}
